In [4]:
import pandas as pd

In [5]:
l = [x for x in range(15)]

In [6]:
l

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

In [7]:
s = pd.Series(l)

In [8]:
s

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
dtype: int64

In [10]:
s = pd.Series(l, index=['a','b','c','d','e','f','g','h','i','j','k','l','m','n','o'])

In [11]:
s

a     0
b     1
c     2
d     3
e     4
f     5
g     6
h     7
i     8
j     9
k    10
l    11
m    12
n    13
o    14
dtype: int64

In [12]:
data = {'a':1,'b':2,'c':3,'d':4,'e':5,'f':6,'g':7,'h':8,'i':9,'j':10,'k':11,'l':12,'m':13,'n':14,'o':15,'p':16,'q':17,'r':18,'s':19,'t':20,'u':21,'v':22,'w':23,'x':24,'y':25,'z':26}

In [13]:
S = pd.Series(data)

In [14]:
S

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
k    11
l    12
m    13
n    14
o    15
p    16
q    17
r    18
s    19
t    20
u    21
v    22
w    23
x    24
y    25
z    26
dtype: int64

In [15]:
S = pd.Series(data, index=['d','e'])

In [16]:
S

d    4
e    5
dtype: int64

In [17]:
S = pd.Series(data, index=['d','e','jh'])

In [18]:
S

d     4.0
e     5.0
jh    NaN
dtype: float64

In [19]:
S = pd.Series(data)

In [20]:
S

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
k    11
l    12
m    13
n    14
o    15
p    16
q    17
r    18
s    19
t    20
u    21
v    22
w    23
x    24
y    25
z    26
dtype: int64

In [21]:
S['a':'g']

a    1
b    2
c    3
d    4
e    5
f    6
g    7
dtype: int64

In [22]:
S[4:9]

e    5
f    6
g    7
h    8
i    9
dtype: int64

In [23]:
S.where(S%3!=0)

a     1.0
b     2.0
c     NaN
d     4.0
e     5.0
f     NaN
g     7.0
h     8.0
i     NaN
j    10.0
k    11.0
l     NaN
m    13.0
n    14.0
o     NaN
p    16.0
q    17.0
r     NaN
s    19.0
t    20.0
u     NaN
v    22.0
w    23.0
x     NaN
y    25.0
z    26.0
dtype: float64

In [24]:
S.where(S%3==0)

a     NaN
b     NaN
c     3.0
d     NaN
e     NaN
f     6.0
g     NaN
h     NaN
i     9.0
j     NaN
k     NaN
l    12.0
m     NaN
n     NaN
o    15.0
p     NaN
q     NaN
r    18.0
s     NaN
t     NaN
u    21.0
v     NaN
w     NaN
x    24.0
y     NaN
z     NaN
dtype: float64

In [25]:
S.where(S%3==0,'Not Divisble by 3')

a    Not Divisble by 3
b    Not Divisble by 3
c                    3
d    Not Divisble by 3
e    Not Divisble by 3
f                    6
g    Not Divisble by 3
h    Not Divisble by 3
i                    9
j    Not Divisble by 3
k    Not Divisble by 3
l                   12
m    Not Divisble by 3
n    Not Divisble by 3
o                   15
p    Not Divisble by 3
q    Not Divisble by 3
r                   18
s    Not Divisble by 3
t    Not Divisble by 3
u                   21
v    Not Divisble by 3
w    Not Divisble by 3
x                   24
y    Not Divisble by 3
z    Not Divisble by 3
dtype: object

In [27]:
S.where(S%3==0,inplace=True)

In [28]:
S.where(S%3==0,inplace=False)

a     NaN
b     NaN
c     3.0
d     NaN
e     NaN
f     6.0
g     NaN
h     NaN
i     9.0
j     NaN
k     NaN
l    12.0
m     NaN
n     NaN
o    15.0
p     NaN
q     NaN
r    18.0
s     NaN
t     NaN
u    21.0
v     NaN
w     NaN
x    24.0
y     NaN
z     NaN
dtype: float64

In [29]:
print(S.where(S%3==0,inplace=True))

None

In [30]:
S

a     NaN
b     NaN
c     3.0
d     NaN
e     NaN
f     6.0
g     NaN
h     NaN
i     9.0
j     NaN
k     NaN
l    12.0
m     NaN
n     NaN
o    15.0
p     NaN
q     NaN
r    18.0
s     NaN
t     NaN
u    21.0
v     NaN
w     NaN
x    24.0
y     NaN
z     NaN
dtype: float64

In [32]:
S.dropna()

c     3.0
f     6.0
i     9.0
l    12.0
o    15.0
r    18.0
u    21.0
x    24.0
dtype: float64

In [33]:
S.fillna('Filled value')

a    Filled value
b    Filled value
c             3.0
d    Filled value
e    Filled value
f             6.0
g    Filled value
h    Filled value
i             9.0
j    Filled value
k    Filled value
l            12.0
m    Filled value
n    Filled value
o            15.0
p    Filled value
q    Filled value
r            18.0
s    Filled value
t    Filled value
u            21.0
v    Filled value
w    Filled value
x            24.0
y    Filled value
z    Filled value
dtype: object

In [34]:
S

a     NaN
b     NaN
c     3.0
d     NaN
e     NaN
f     6.0
g     NaN
h     NaN
i     9.0
j     NaN
k     NaN
l    12.0
m     NaN
n     NaN
o    15.0
p     NaN
q     NaN
r    18.0
s     NaN
t     NaN
u    21.0
v     NaN
w     NaN
x    24.0
y     NaN
z     NaN
dtype: float64

In [35]:
###PANDAS DATAFRAME###

In [36]:
df = pd.DataFrame()

In [37]:
df

Empty DataFrame
Columns: []
Index: []

In [38]:
type(df)

pandas.core.frame.DataFrame

In [39]:
df = pd.read_csv('/Users/aakarshan/Documents/Documents HD2/SimpliLearn/New Session/Assignements/Chapter 4/Practice/DataScienceWithPython/OSL_Datasets/Lesson_09_Pandas/9.05_Pandas_DataFrame/PandasExample.csv')

In [40]:
df

           Name  Age  Gender
0        Nithin   24    Male
1         Manoj   30    Male
2  Shivashankar   44    Male
3        Swathi   18  Female
4   Pareekshith   28    Male

In [41]:
df.head(2)

     Name  Age Gender
0  Nithin   24   Male
1   Manoj   30   Male

In [42]:
df.tail(2)

          Name  Age  Gender
3       Swathi   18  Female
4  Pareekshith   28    Male

In [43]:
df.iloc[1:4]

           Name  Age  Gender
1         Manoj   30    Male
2  Shivashankar   44    Male
3        Swathi   18  Female

In [44]:
df.iloc[2]

Name      Shivashankar
Age                 44
Gender            Male
Name: 2, dtype: object

In [46]:
df = pd.read_csv('/Users/aakarshan/Documents/Documents HD2/SimpliLearn/New Session/Assignements/Chapter 4/Practice/DataScienceWithPython/OSL_Datasets/Lesson_09_Pandas/9.05_Pandas_DataFrame/PandasExample.csv',chunksize=2)

In [47]:
for chunk in df:
    print(chunk)
    print("n")
    print("n")
    print("n")

     Name  Age Gender
0  Nithin   24   Male
1   Manoj   30   Male
n
n
n
           Name  Age  Gender
2  Shivashankar   44    Male
3        Swathi   18  Female
n
n
n
          Name  Age Gender
4  Pareekshith   28   Male
n
n
n

In [48]:
df = pd.read_csv('/Users/aakarshan/Documents/Documents HD2/SimpliLearn/New Session/Assignements/Chapter 4/Practice/DataScienceWithPython/OSL_Datasets/Lesson_09_Pandas/9.05_Pandas_DataFrame/PandasExample.csv')

In [49]:
df

           Name  Age  Gender
0        Nithin   24    Male
1         Manoj   30    Male
2  Shivashankar   44    Male
3        Swathi   18  Female
4   Pareekshith   28    Male

In [50]:
df['Age']>25

0    False
1     True
2     True
3    False
4     True
Name: Age, dtype: bool

In [55]:
df[df['Age']>25]

           Name  Age Gender
1         Manoj   30   Male
2  Shivashankar   44   Male
4   Pareekshith   28   Male

In [56]:
df['Name']=='Nithin'

0     True
1    False
2    False
3    False
4    False
Name: Name, dtype: bool

In [57]:
df[df['Name']=='Manoj']

    Name  Age Gender
1  Manoj   30   Male

In [58]:
df['Gender']=='Female'

0    False
1    False
2    False
3     True
4    False
Name: Gender, dtype: bool

In [59]:
df[df['Gender']=='Female']

     Name  Age  Gender
3  Swathi   18  Female

In [60]:
df.values

array([['Nithin', 24, 'Male'],
       ['Manoj', 30, 'Male'],
       ['Shivashankar', 44, 'Male'],
       ['Swathi', 18, 'Female'],
       ['Pareekshith', 28, 'Male']], dtype=object)

In [65]:
grades = pd.Categorical(['A','A','C','F','B','C','F','D'], ordered=True)

In [66]:
grades

['A', 'A', 'C', 'F', 'B', 'C', 'F', 'D']
Categories (5, object): ['A' < 'B' < 'C' < 'D' < 'F']

In [67]:
grades = grades.reorder_categories(['F','D','C','B','A'])

In [68]:
grades

['A', 'A', 'C', 'F', 'B', 'C', 'F', 'D']
Categories (5, object): ['F' < 'D' < 'C' < 'B' < 'A']

In [71]:
grades2 = pd.Categorical(['A','A','C','F','B','C','F','D'], ordered=False)

In [72]:
grades2

['A', 'A', 'C', 'F', 'B', 'C', 'F', 'D']
Categories (5, object): ['A', 'B', 'C', 'D', 'F']

In [73]:
type(grades)

pandas.core.arrays.categorical.Categorical

In [74]:
type(grades2)

pandas.core.arrays.categorical.Categorical

In [75]:
df = pd.Series(['a','b','c','d','e'])

In [76]:
df

0    a
1    b
2    c
3    d
4    e
dtype: object

In [77]:
df = pd.Series(['a','b','c','d','e'], dtype='string')

In [78]:
df

0    a
1    b
2    c
3    d
4    e
dtype: string

In [79]:
dfi = pd.Series([1,2,3,4,5])

In [80]:
dfi

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [81]:
dfi = pd.Series([1,2,3,4,5],dtype='int8')

In [83]:
dfi

0    1
1    2
2    3
3    4
4    5
dtype: int8

In [86]:
dff = pd.Series([1,2,3,4,5,6,7,8,9,10], dtype='float')

In [87]:
dff

0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     6.0
6     7.0
7     8.0
8     9.0
9    10.0
dtype: float64

In [88]:
dff = pd.Series([1,2,3,4,5,6,7,8,9,10], dtype='float32')

In [89]:
dff

0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     6.0
6     7.0
7     8.0
8     9.0
9    10.0
dtype: float32

In [90]:
dfs = pd.Series([1,2,3,4,5,6,7,8,9,10], dtype='string')

In [91]:
dfs

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: string

In [92]:
df

0    a
1    b
2    c
3    d
4    e
dtype: string

In [93]:
df.str.len()

0    1
1    1
2    1
3    1
4    1
dtype: Int64

In [94]:
df.str.upper()

0    A
1    B
2    C
3    D
4    E
dtype: string

In [95]:
df

0    a
1    b
2    c
3    d
4    e
dtype: string

In [98]:
(df.str.upper()).str.lower()

0    a
1    b
2    c
3    d
4    e
dtype: string

In [99]:
dfs.str.upper()

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: string

In [100]:
dfs = pd.Series(['Aakarshan','Shruti','Sharma','Sarat'], dtype='string')

In [101]:
dfs

0    Aakarshan
1       Shruti
2       Sharma
3        Sarat
dtype: string

In [102]:
dfs.str.len()

0    9
1    6
2    6
3    5
dtype: Int64

In [103]:
dfs.str.upper()

0    AAKARSHAN
1       SHRUTI
2       SHARMA
3        SARAT
dtype: string

In [104]:
dfs.str.lower()

0    aakarshan
1       shruti
2       sharma
3        sarat
dtype: string

In [105]:
dfs.str.split('s')

0    [Aakar, han]
1        [Shruti]
2        [Sharma]
3         [Sarat]
dtype: object

In [106]:
dfs.str.lower().str.split('s')

0    [aakar, han]
1       [, hruti]
2       [, harma]
3        [, arat]
dtype: object

In [107]:
dfs.str.replace('S','A')

0    Aakarshan
1       Ahruti
2       Aharma
3        Aarat
dtype: string

In [108]:
dfs

0    Aakarshan
1       Shruti
2       Sharma
3        Sarat
dtype: string

In [109]:
dfs.str.find('s')

0     5
1    -1
2    -1
3    -1
dtype: Int64

In [110]:
dfs.str.find('S')

0    -1
1     0
2     0
3     0
dtype: Int64

In [111]:
dfs.str.find('sh')

0     5
1    -1
2    -1
3    -1
dtype: Int64

In [112]:
dfs.str.cat(sep=' Loves ')

'Aakarshan Loves Shruti Loves Sharma Loves Sarat'

In [113]:
dfs

0    Aakarshan
1       Shruti
2       Sharma
3        Sarat
dtype: string

In [114]:
dfs[0:1]

0    Aakarshan
dtype: string

In [115]:
dfs[0:2]

0    Aakarshan
1       Shruti
dtype: string

In [116]:
dfs[0:2].str.cat(sep=' Loves ')

'Aakarshan Loves Shruti'